Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [1]:
import pandas as pd
series = pd.Series([4,8,15,16,23,42])
series

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [2]:
list1 = list(range(10))
s = pd.Series(list1)
s

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int64

Q3. Create a Pandas DataFrame that contains the following data:

Then, print the DataFrame.

In [3]:
dict1 = {'Name':['Alice','Bob','Claire'],'Age':[25,30,27],'Gender':['Female','Male','Female']}
df = pd.DataFrame(dict1)
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

In [4]:
# DataFrame is a two-dimensional, tabular data structure with (rows and columns). It can be thought of as a spreadsheet or a SQL 
# table, where data is organized in rows and columns. 

# Each column in a DataFrame is a pandas Series, and the entire DataFrame can be seen as a collection of Series that share the 
# same index.
# A pandas Series is a one-dimensional labeled array that can hold any data type. It is similar to a column in a DataFrame, but
# it doesn't have column names, only a general index.

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

In [5]:
# Pandas provides a wide range of functions to manipulate and analyze data in DataFrames.
# head() and tail(): These functions are used to display the first or last few rows of a DataFrame.

df.head(3)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [6]:
# info(): Provides a concise summary of the DataFrame, including information about the data types, non-null values, and memory 
# usage.
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     3 non-null      int64
 2   Gender  3 non-null      object
dtypes: int64(1), object(2)
memory usage: 200.0+ bytes

In [7]:
# shape: Returns a tuple representing the dimensions of the DataFrame (number of rows, number of columns).
print(df.shape)
# describe(): Generates descriptive statistics of the DataFrame, such as count, mean, standard deviation, min, and max.
df.describe()

(3, 3)

             Age
count   3.000000
mean   27.333333
std     2.516611
min    25.000000
25%    26.000000
50%    27.000000
75%    28.500000
max    30.000000

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

In [8]:
# In pandas, both Series and DataFrame are mutable, while Panel is not.
# Panels were part of pandas in earlier versions for handling three-dimensional data.

Q7. Create a DataFrame using multiple Series. Explain with an example.

In [9]:
# Creating multiple Series
names = pd.Series(['Alice', 'Bob', 'Charlie'])
ages = pd.Series([25, 30, 22])
cities = pd.Series(['New York', 'San Francisco', 'Los Angeles'])

# Combining Series into a DataFrame
data = {'Name': names, 'Age': ages, 'City': cities}
df = pd.DataFrame(data)

# Display the resulting DataFrame
df

      Name  Age           City
0    Alice   25       New York
1      Bob   30  San Francisco
2  Charlie   22    Los Angeles